import { NextResponse } from "next/server"

export async function GET() {
    try {
        
        return NextResponse.json({facility: [
            'American Express', 'Mastercard', 'Visa', 
            'Wifi ฟรี', 'การจอง', 'การรับประทานอาหารแบบส่วนตัว', 
            'ค้นพบ', 'ชายหาด', 'ซื้อกลับบ้าน',
            'ดนตรีสด', 'ที่จอดรถริมถนน', 'ที่จอดรถริมทางฟรี',
            'ที่จอดรถแบบประทับตรา', 'ที่นั่ง', 'ที่นั่งกลางแจ้ง',
            'บริการจอดรถ', 'บริการส่ง', 'บริการเครื่องดื่มแอลกอฮอล์',
            'บริการเสิร์ฟถึงโต๊ะ', 'บาร์ชมกีฬา', 'บาร์ดนตรีแจ๊ส',
            'บาร์เต็มรูปแบบ', 'บุฟเฟ่ต์', 'มีที่จอดรถ',
            'มีบัตรของขวัญ', 'มีเก้าอี้สูงสำหรับเด็ก', 'รับชำระเงินแบบดิจิทัล',
            'รับบัตรเครดิต', 'รับเฉพาะเงินสด', 'ริมน้ำ',
            'ร้านอาหารปลอดบุหรี่', 'สนามเด็กเล่น', 'สะดวกสำหรับผู้ใช้รถเข็น',
            'สามารถนำเครื่องดื่มแอลกอฮอล์มาเอง', 'เป็นมิตรกับสุนัข', 'แบบครอบครัว',
            'โทรทัศน์', 'ไดร์ฟ-ทรู', 'ไวน์และเบียร์',
        ]}, {status: 201})
    } catch(error) {
        return NextResponse.json({ message: `An error occured while insert data attraction ${error}`}, {status: 500})
    }
}